function show(argument) {
	console.log(argument)
}

////////// 1 ///////////
show('-----1-----');

var n = 5;
show(n % 2 === 0? 'Число є парним': 'Число непарне');

////////// 2 ///////////
show('-----2-----');

var number1 = 5.7;
var number2 = 13.34;

show(Math.abs(number1 - 10) < Math.abs(number2 - 10)? 
	'Перше число ближче до десяти': 'Друге число ближче до десяти');



// 1. Написати програму, що перевіряє і повідомляє на екран, чи є ціле число записане в змінну n , 
// парним або непарним. 

// 2. Написати програму, що буде виводити на екран найближче до 10 з двох чисел. Наприклад, серед 
// чисел 8,5 і 11,45 найближче до десяти є 11,45. 
